**Sample Coding Question:**
Question: "Given a dataset containing sales data, write a Python function to calculate the total sales for each product category. The dataset is provided as a pandas DataFrame with columns ProductID, Category, and Sales."

In [1]:
import pandas as pd

# Sample DataFrame to simulate the sales data
data = {
    'ProductID': [101, 102, 103, 104, 105, 106],
    'Category': ['Electronics', 'Clothing', 'Electronics', 'Clothing', 'Home', 'Home'],
    'Sales': [1500, 250, 2300, 300, 1200, 700]
}

df = pd.DataFrame(data)
print("Sample DataFrame:")
print(df)

Sample DataFrame:
   ProductID     Category  Sales
0        101  Electronics   1500
1        102     Clothing    250
2        103  Electronics   2300
3        104     Clothing    300
4        105         Home   1200
5        106         Home    700

In [21]:
sum_cat = df.groupby('Category')['Sales'].sum()
sum_cat

Category
Clothing        550
Electronics    3800
Home           1900
Name: Sales, dtype: int64

**Sample Coding Question:**
Question: "Given a DataFrame containing user data with columns UserID, Age, and Subscription, write a Python function to calculate the average age of users for each subscription type."

In [23]:
import pandas as pd

# Sample DataFrame to simulate the user data
data = {
    'UserID': [1, 2, 3, 4, 5, 6],
    'Age': [23, 45, 25, 35, 40, 22],
    'Subscription': ['Basic', 'Premium', 'Basic', 'Premium', 'Basic', 'Premium']
}

df = pd.DataFrame(data)
print("Sample DataFrame:")
print(df)

Sample DataFrame:
   UserID  Age Subscription
0       1   23        Basic
1       2   45      Premium
2       3   25        Basic
3       4   35      Premium
4       5   40        Basic
5       6   22      Premium

In [29]:
mean_age = df.groupby('Subscription')['Age'].mean()
mean_age

Subscription
Basic      29.333333
Premium    34.000000
Name: Age, dtype: float64

**Sample Coding Question:**
Question: "Given a DataFrame containing sales data with columns Date, Product, and Revenue, write a Python function to calculate the total revenue generated per product per month. The Date column is in the format YYYY-MM-DD."

In [32]:
import pandas as pd

# Sample DataFrame to simulate the sales data
data = {
    'Date': ['2023-01-15', '2023-01-20', '2023-02-05', '2023-02-15', '2023-03-01', '2023-03-10'],
    'Product': ['A', 'B', 'A', 'B', 'A', 'B'],
    'Revenue': [100, 200, 150, 250, 300, 350]
}

df = pd.DataFrame(data)
print("Sample DataFrame:")
print(df)

Sample DataFrame:
         Date Product  Revenue
0  2023-01-15       A      100
1  2023-01-20       B      200
2  2023-02-05       A      150
3  2023-02-15       B      250
4  2023-03-01       A      300
5  2023-03-10       B      350

In [60]:
df['Date'] = pd.to_datetime(df['Date'])

df['YearMonth'] = df['Date'].dt.to_period('M')

df_monthly_sales = df.groupby(['YearMonth','Product'])['Revenue'].sum()
df_monthly_sales

YearMonth  Product
2023-01    A          100
           B          200
2023-02    A          150
           B          250
2023-03    A          300
           B          350
Name: Revenue, dtype: int64

**Sample Coding Question:**
Question: "Given a DataFrame containing employee data with columns EmployeeID, Department, Salary, write a Python function to calculate the average salary for each department."

In [63]:
data = {
    'EmployeeID': ['1234','2345','3456','4567','5678','6789'],
    'Department': ['a','b','c','a','a','b'],
    'Salary': [1000,2000,1000,3000,2000,1000]
}

df = pd.DataFrame(data)
df

  EmployeeID Department  Salary
0       1234          a    1000
1       2345          b    2000
2       3456          c    1000
3       4567          a    3000
4       5678          a    2000
5       6789          b    1000

In [65]:
avg_sal = df.groupby('Department')['Salary'].mean()
avg_sal

Department
a    2000.0
b    1500.0
c    1000.0
Name: Salary, dtype: float64

**Sample Coding Question:**
Question: "Given a DataFrame containing student grades with columns StudentID, Subject, and Grade, write a Python function to calculate the average grade for each student across all subjects."

In [70]:
data = {
    'StudentID': ['s1','s2','s1','s1','s3','s2'],
    'Subject': ['Science','Math','Science','English','CompSci','English'],
    'Grade': [80,70,50,30,80,60]
}

df = pd.DataFrame(data)
df

  StudentID  Subject  Grade
0        s1  Science     80
1        s2     Math     70
2        s1  Science     50
3        s1  English     30
4        s3  CompSci     80
5        s2  English     60

In [74]:
avg_grade = df.groupby('StudentID')['Grade'].mean()
avg_grade

StudentID
s1    53.333333
s2    65.000000
s3    80.000000
Name: Grade, dtype: float64

**Sample Coding Question:**
Question: "Given two DataFrames, one containing employee information (EmployeeID, Name, Department) and another containing their salaries (EmployeeID, Salary), write a Python function to merge these DataFrames and then filter out employees with a salary greater than a specified amount."

In [97]:
data1 = {
    'EmployeeID': ['1','2','3','4','5','6'],
    'Name': ['Rob','Emily','Sham','Marcus','Jade','Olivia'],
    'Department': ['IT','Sales','IT','Marketing','Management','Marketing']
}

data2 = {
    'EmployeeID': ['1','3','2','4','5','6'],
    'Salary': [20000,30000,40000,30000,50000,35000]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

print(df1)
print("\n")
print(df2)

  EmployeeID    Name  Department
0          1     Rob          IT
1          2   Emily       Sales
2          3    Sham          IT
3          4  Marcus   Marketing
4          5    Jade  Management
5          6  Olivia   Marketing


  EmployeeID  Salary
0          1   20000
1          3   30000
2          2   40000
3          4   30000
4          5   50000
5          6   35000

In [95]:
df_add_sal = pd.merge(df1,df2, on=['EmployeeID'])
df_add_sal

  EmployeeID    Name  Department  Salary
0          1     Rob          IT   20000
1          2   Emily       Sales   40000
2          3    Sham          IT   30000
3          4  Marcus   Marketing   30000
4          5    Jade  Management   50000
5          6  Olivia   Marketing   35000

In [111]:
df_remove_top_earners = df_add_sal[df_add_sal['Salary']<=30000]
df_remove_top_earners

  EmployeeID    Name Department  Salary
0          1     Rob         IT   20000
2          3    Sham         IT   30000
3          4  Marcus  Marketing   30000

Adding a raise to the joined tables

In [115]:
df_add_sal['Raise'] = df_add_sal['Salary']*1.05 
df_add_sal

  EmployeeID    Name  Department  Salary    Raise
0          1     Rob          IT   20000  21000.0
1          2   Emily       Sales   40000  42000.0
2          3    Sham          IT   30000  31500.0
3          4  Marcus   Marketing   30000  31500.0
4          5    Jade  Management   50000  52500.0
5          6  Olivia   Marketing   35000  36750.0

**Another Coding Question:**
Question: "Given a DataFrame containing order information with columns OrderID, CustomerID, OrderDate, and OrderAmount, write a Python function to calculate the total order amount for each customer and find the customer who spent the most."

In [119]:
import pandas as pd

# Sample DataFrame to simulate order information
data = {
    'OrderID': ['O1', 'O2', 'O3', 'O4', 'O5', 'O6'],
    'CustomerID': ['C1', 'C2', 'C1', 'C3', 'C2', 'C3'],
    'OrderDate': ['2023-01-01', '2023-01-05', '2023-01-10', '2023-01-15', '2023-01-20', '2023-01-25'],
    'OrderAmount': [100, 200, 150, 300, 250, 400]
}

df = pd.DataFrame(data)
print("Sample DataFrame:")
print(df)

Sample DataFrame:
  OrderID CustomerID   OrderDate  OrderAmount
0      O1         C1  2023-01-01          100
1      O2         C2  2023-01-05          200
2      O3         C1  2023-01-10          150
3      O4         C3  2023-01-15          300
4      O5         C2  2023-01-20          250
5      O6         C3  2023-01-25          400

In [143]:
df_customer_spend = df.groupby('CustomerID')['OrderAmount'].sum().sort_values(ascending = False)
print("\nThe customer who has spent the most will appear as the first entry in the below table:\n\n",df_customer_spend)

The customer who has spent the most will appear as the first entry in the below table:

 CustomerID
C3    700
C2    450
C1    250
Name: OrderAmount, dtype: int64

Question: "Given the same DataFrame, write a Python function to find the average order amount for each customer and sort the results in descending order."

In [150]:
df_avg_spend = df.groupby('CustomerID')['OrderAmount'].mean().sort_values(ascending=False)
df_avg_spend
print("\nThe average customer spend is:\n\n",df_avg_spend)

The average customer spend is:

 CustomerID
C3    350.0
C2    225.0
C1    125.0
Name: OrderAmount, dtype: float64

**Sample Coding Question:**
Question: "Given a DataFrame containing sales data with columns SalesID, Product, Region, SalesDate, and SalesAmount, write a Python function to calculate the total sales for each product in each region for the year 2023. Additionally, add a new column to indicate whether each sale was above or below the average sales amount for that product."

In [153]:
import pandas as pd

# Sample DataFrame to simulate sales data
data = {
    'SalesID': ['S1', 'S2', 'S3', 'S4', 'S5', 'S6', 'S7', 'S8'],
    'Product': ['A', 'B', 'A', 'C', 'B', 'C', 'A', 'B'],
    'Region': ['North', 'South', 'North', 'East', 'South', 'East', 'West', 'North'],
    'SalesDate': ['2023-01-05', '2023-02-15', '2023-03-25', '2022-12-30', '2023-04-05', '2023-06-18', '2023-08-22', '2023-11-30'],
    'SalesAmount': [500, 300, 700, 200, 400, 600, 800, 350]
}

df = pd.DataFrame(data)
print("Sample DataFrame:")
print(df)

Sample DataFrame:
  SalesID Product Region   SalesDate  SalesAmount
0      S1       A  North  2023-01-05          500
1      S2       B  South  2023-02-15          300
2      S3       A  North  2023-03-25          700
3      S4       C   East  2022-12-30          200
4      S5       B  South  2023-04-05          400
5      S6       C   East  2023-06-18          600
6      S7       A   West  2023-08-22          800
7      S8       B  North  2023-11-30          350

In [219]:
df['SalesDate'] = pd.to_datetime(df['SalesDate'])

df['Year'] = df['SalesDate'].dt.to_period('Y')

df_2023 = df[df['Year'] == '2023']

df_total_sales_2023 = df_2023.groupby(['Region','Product'])['SalesAmount'].sum().reset_index()
df_total_sales_2023

  Region Product  SalesAmount
0   East       C          600
1  North       A         1200
2  North       B          350
3  South       B          700
4   West       A          800

In [223]:
avg_sales_amnt = df_total_sales_2023['SalesAmount'].mean()
avg_sales_amnt

730.0

In [227]:
df_total_sales_2023['Above Average'] = df_total_sales_2023['SalesAmount']>=avg_sales_amnt
df_total_sales_2023

  Region Product  SalesAmount  Above Average
0   East       C          600          False
1  North       A         1200           True
2  North       B          350          False
3  South       B          700          False
4   West       A          800           True